[
  { "Name": "Microsoft.3DBuilder", "Recommended": true, "Description": "3D modeller oluşturma ve düzenleme uygulaması." },
  { "Name": "Microsoft.BingFinance", "Recommended": true, "Description": "Finans haberleri ve piyasa takibi uygulaması." },
  { "Name": "Microsoft.BingNews", "Recommended": true, "Description": "Bing Haberler uygulaması." },
  { "Name": "Microsoft.BingWeather", "Recommended": true, "Description": "Bing Hava Durumu uygulaması." },
  { "Name": "Microsoft.CommsPhone", "Recommended": true, "Description": "Telefon görüşmeleri ve mesajlaşma ile ilgili uygulama." },
  { "Name": "Microsoft.GetHelp", "Recommended": true, "Description": "Windows yardım ve destek uygulaması." },
  { "Name": "Microsoft.Getstarted", "Recommended": true, "Description": "Windows'a giriş ve kullanım ipuçları uygulaması." },
  { "Name": "Microsoft.Messaging", "Recommended": true, "Description": "Microsoft'un eski mesajlaşma platformu." },
  { "Name": "Microsoft.Microsoft3DViewer", "Recommended": true, "Description": "3D modelleri görüntüleme uygulaması." },
  { "Name": "Microsoft.MicrosoftOfficeHub", "Recommended": true, "Description": "Office uygulamaları için bir başlangıç noktası." },
  { "Name": "Microsoft.MicrosoftSolitaireCollection", "Recommended": true, "Description": "Solitaire, Mayın Tarlası gibi klasik oyunların koleksiyonu." },
  { "Name": "Microsoft.MinecraftUWP", "Recommended": false, "Description": "Minecraft Windows 10 sürümü (eğer yüklüyse)." },
  { "Name": "Microsoft.MixedReality.Portal", "Recommended": true, "Description": "Karma Gerçeklik (VR/AR) cihazları için portal (kullanmıyorsanız)." },
  { "Name": "Microsoft.NetworkSpeedTest", "Recommended": true, "Description": "Ağ hız testi uygulaması." },
  { "Name": "Microsoft.Office.Sway", "Recommended": true, "Description": "Sunum ve dijital hikaye oluşturma uygulaması." },
  { "Name": "Microsoft.OneConnect", "Recommended": true, "Description": "Mobil cihaz entegrasyonu ile ilgili bir uygulama." },
  { "Name": "Microsoft.OneNote", "Recommended": true, "Description": "OneNote masaüstü uygulamasının modern (UWP) versiyonu. (Masaüstü versiyonunu tercih ediyorsanız kaldırılabilir.)" },
  { "Name": "Microsoft.People", "Recommended": true, "Description": "Kişi listenizi yönetme uygulaması." },
  { "Name": "Microsoft.PowerAutomateDesktop", "Recommended": false, "Description": "Masaüstü otomasyon akışları oluşturma aracı." },
  { "Name": "Microsoft.Print3D", "Recommended": true, "Description": "3D yazıcılar ve modeller için araçlar." },
  { "Name": "Microsoft.RemoteDesktop", "Recommended": true, "Description": "Microsoft Uzak Masaüstü uygulaması. **UYARI**: Başka bilgisayarlara uzaktan bağlanmak için bu uygulamayı kullanıyorsanız kaldırmayın." },
  { "Name": "Microsoft.ScreenSketch", "Recommended": true, "Description": "Yeni Ekran Alıntısı Aracı ve taslak özelliği. **UYARI**: Ekran görüntüsü almak ve düzenlemek için bu uygulamayı sıkça kullanıyorsanız kaldırmayın. Alternatif olarak Print Screen ve Paint gibi araçlar mevcuttur." },
  { "Name": "Microsoft.SkypeApp", "Recommended": true, "Description": "Skype'ın modern (UWP) versiyonu (masaüstü versiyonunu veya farklı bir iletişim aracını tercih ediyorsanız)." },
  { "Name": "Microsoft.Todos", "Recommended": true, "Description": "Microsoft To Do uygulaması." },
  { "Name": "Microsoft.Wallet", "Recommended": true, "Description": "Windows Cüzdan uygulaması." },
  { "Name": "Microsoft.WindowsAlarms", "Recommended": true, "Description": "Alarmlar, Saat ve Zamanlayıcı uygulaması. Bu özelliklere ihtiyacınız yoksa kaldırabilirsiniz." },
  { "Name": "Microsoft.WindowsCamera", "Recommended": true, "Description": "Windows Kamera uygulaması. Dahili veya harici bir kameranız yoksa veya farklı bir kamera uygulaması kullanıyorsanız kaldırabilirsiniz." },
  { "Name": "Microsoft.WindowsCommunicationsApps", "Recommended": true, "Description": "Posta ve Takvim uygulamalarını içeren paket. Outlook masaüstü uygulamasını veya web tabanlı e-posta/takvim hizmetlerini kullanıyorsanız kaldırabilirsiniz." },
  { "Name": "Microsoft.WindowsFeedbackHub", "Recommended": true, "Description": "Microsoft'a geri bildirim gönderme uygulaması. Geri bildirimde bulunmuyorsanız veya Windows geliştirmesine katkıda bulunmak istemiyorsanız kaldırabilirsiniz." },
  { "Name": "Microsoft.WindowsMaps", "Recommended": true, "Description": "Windows Haritalar uygulaması. Genellikle Google Haritalar gibi web tabanlı harita hizmetleri kullanılıyorsa gereksizdir." },
  { "Name": "Microsoft.WindowsSoundRecorder", "Recommended": true, "Description": "Ses Kaydedici uygulaması. Ses kaydetmek için başka bir yazılım kullanmıyorsanız veya bu özelliğe ihtiyacınız yoksa kaldırabilirsiniz." },
  { "Name": "Microsoft.Xbox.TCUI", "Recommended": true, "Description": "Xbox Kullanıcı Arayüzü ile ilgili bir bileşen. **UYARI**: Xbox uygulamalarını, oyun çubuğunu veya ilgili özellikleri aktif olarak kullanıyorsanız, kaldırmak bazı işlevleri bozabilir." },
  { "Name": "Microsoft.XboxApp", "Recommended": true, "Description": "Xbox uygulaması. **UYARI**: Bilgisayarınızda Xbox oyunları oynamıyorsanız veya Xbox Game Pass gibi hizmetleri kullanmıyorsanız kaldırabilirsiniz. Kaldırmak Xbox ile ilgili tüm entegrasyonları sona erdirir." },
  { "Name": "Microsoft.XboxGameCallableUI", "Recommended": true, "Description": "Xbox oyunlarında kullanılabilen kullanıcı arayüzü bileşeni. **UYARI**: Xbox oyunlarını aktif olarak oynuyorsanız veya Xbox Game Bar gibi özellikleri kullanıyorsanız, kaldırmak sorunlara yol açabilir." },
  { "Name": "Microsoft.XboxGameOverlay", "Recommended": true, "Description": "Xbox Oyun Çubuğu katmanı. **UYARI**: Oyun oynarken ekran kaydı, performans takibi veya diğer oyun çubuğu özelliklerini kullanıyorsanız kaldırmayın." },
  { "Name": "Microsoft.XboxGamingOverlay", "Recommended": true, "Description": "Xbox Oyun Çubuğu ve ilgili özelliklerin genel paketi. **UYARI**: Oyun özelliklerini aktif olarak kullanıyorsanız kaldırmayın." },
  { "Name": "Microsoft.XboxIdentityProvider", "Recommended": true, "Description": "Xbox kimlik doğrulama hizmeti. **UYARI**: Xbox ile ilgili herhangi bir uygulamayı, oyunu veya hizmeti kullanıyorsanız, kaldırmak oturum açma sorunlarına neden olabilir." },
  { "Name": "Microsoft.XboxSpeechToTextOverlay", "Recommended": true, "Description": "Xbox konuşmadan metne özelliği. **UYARI**: Oyun içi sohbet veya diğer konuşma tabanlı Xbox özelliklerini kullanıyorsanız kaldırmayın." },
  { "Name": "Microsoft.YourPhone", "Recommended": true, "Description": "Telefonunuz uygulaması (eski adıyla Your Phone). Telefonunuzu bilgisayarınıza bağlamıyor, aramaları/mesajları bilgisayar üzerinden yönetmiyorsanız kaldırabilirsiniz." },
  { "Name": "Microsoft.ZuneMusic", "Recommended": true, "Description": "Groove Müzik uygulaması (eski Zune). Başka bir müzik çalar veya yayın hizmeti kullanıyorsanız kaldırabilirsiniz." },
  { "Name": "Microsoft.ZuneVideo", "Recommended": true, "Description": "Filmler ve TV uygulaması (eski Zune). Başka bir video oynatıcı veya yayın hizmeti kullanıyorsanız kaldırabilirsiniz." },
  { "Name": "EclipseManager", "Recommended": true, "Description": "Üçüncü taraf sponsorlu uygulama." },
  { "Name": "ActiproSoftwareLLC", "Recommended": true, "Description": "Üçüncü taraf sponsorlu uygulama." },
  { "Name": "Duolingo-LearnLanguagesforFree", "Recommended": true, "Description": "Duolingo dil öğrenme uygulaması. Web sitesini veya mobil uygulamasını kullanıyorsanız bilgisayarda tutmanız gerekmez." },
  { "Name": "PandoraMediaInc", "Recommended": true, "Description": "Pandora müzik uygulaması. Başka müzik platformları kullanıyorsanız veya tarayıcıdan erişiyorsanız kaldırabilirsiniz." },
  { "Name": "CandyCrush", "Recommended": true, "Description": "Candy Crush Saga oyunu. Sistemde oyun oynamıyorsanız veya bu oyunu sevmiyorsanız kaldırabilirsiniz." },
  { "Name": "Wunderlist", "Recommended": true, "Description": "Yapılacaklar listesi uygulaması. Microsoft To Do'ya geçiş yapıldı, bu uygulama artık aktif olarak güncellenmiyor olabilir." },
  { "Name": "Flipboard", "Recommended": true, "Description": "Haber ve makale okuyucu uygulaması. Haberleri başka kaynaklardan takip ediyorsanız gereksizdir." },
  { "Name": "Twitter", "Recommended": true, "Description": "Twitter uygulaması. Twitter'a tarayıcıdan veya farklı bir istemciden erişiyorsanız kaldırabilirsiniz." },
  { "Name": "Facebook", "Recommended": true, "Description": "Facebook uygulaması. Facebook'a tarayıcıdan veya mobil uygulamadan erişiyorsanız kaldırabilirsiniz." },
  { "Name": "Spotify", "Recommended": true, "Description": "Spotify müzik uygulaması. Masaüstü Spotify uygulamasını kullanıyorsanız veya tarayıcıdan erişiyorsanız kaldırabilirsiniz." },
  { "Name": "Dolby", "Recommended": false, "Description": "Dolby ses teknolojisi uygulaması. **UYARI**: Eğer ses kartınız veya hoparlör sisteminiz Dolby teknolojisini kullanıyorsa ve bu uygulama ses deneyiminizin bir parçasıysa, kaldırmak ses kalitenizi etkileyebilir. Emin değilseniz bırakın." },
  { "Name": "Microsoft-Windows-FaxPrint", "Recommended": true, "Description": "Windows Faks ve Tarama özelliği. Faks veya tarayıcı kullanmıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-WordPad", "Recommended": true, "Description": "Windows'un basit metin düzenleyicisi Wordpad. Daha gelişmiş bir metin işlemci kullanıyorsanız (örn. Notepad++, MS Word) kaldırılabilir." },
  { "Name": "Microsoft-Windows-Notepad", "Recommended": false, "Description": "Windows Not Defteri. Metin düzenleyici olarak başka bir uygulama kullanıyorsanız kaldırılabilir. **UYARI**: Basit metin dosyalarını açmak için hızlı bir araca ihtiyacınız varsa dikkatli olun." },
  { "Name": "Microsoft-Windows-ProblemStepsRecorder", "Recommended": true, "Description": "Adım Kaydedici (Problem Steps Recorder). Bilgisayarda yapılan işlemleri ekran görüntüleriyle kaydetmek için kullanılır. Bu özelliği kullanmıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-PowerShell-ISE", "Recommended": true, "Description": "PowerShell Entegre Komut Dosyası Ortamı (ISE). PowerShell komut dosyaları yazmıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-TabletPCMathInputPanel", "Recommended": true, "Description": "Matematiksel İfade Tanıyıcı (TabletPC'ler için). Dokunmatik ekranı olan bir TabletPC'niz yoksa veya matematiksel ifadeleri elle yazmıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-Subsystem-Linux", "Recommended": true, "Description": "Linux için Windows Alt Sistemi (WSL). Windows üzerinde Linux dağıtımları çalıştırmıyorsanız kaldırılabilir. Geliştiriciler için faydalı bir özelliktir." },
  { "Name": "Microsoft-Windows-QuickAssist", "Recommended": true, "Description": "Hızlı Destek Asistanı. Başka birine uzaktan yardım etmek veya uzaktan yardım almak için kullanılır. Alternatif (TeamViewer, AnyDesk vb.) kullanıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-Hello-Face", "Recommended": true, "Description": "Windows Hello Yüz Tanıma Sistemi. Yüz tanıma ile oturum açma özelliği. Bu özelliği kullanmıyorsanız veya kameranız desteklemiyorsa kaldırılabilir." },
  { "Name": "OpenSSH.Client", "Recommended": false, "Description": "OpenSSH İstemcisi. Güvenli ağ protokolü. SSH bağlantılarına ihtiyacınız yoksa kaldırılabilir. (Geliştiriciler ve sistem yöneticileri için genellikle gereklidir)." },
  { "Name": "OpenSSH.Server", "Recommended": true, "Description": "OpenSSH Sunucusu. Windows'un SSH sunucusu olarak çalışmasına izin verir. Bu özelliğe ihtiyacınız yoksa kaldırılabilir." },
  { "Name": "Microsoft-Windows-ProjFS", "Recommended": true, "Description": "Öngörülen Dosya Sistemi (ProjFS). Kurumsal özellik olup genellikle yazılım geliştiricileri tarafından kullanılır. Standart kullanıcılar için gereksizdir." },
  { "Name": "Microsoft-Windows-RemoteAssistance", "Recommended": true, "Description": "Uzaktan Yardım. Başka birine uzaktan yardım etmek veya uzaktan yardım almak için kullanılır. Hızlı destekten farklı bir yapıdır. Kullanmıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-Client-Side-Caching", "Recommended": true, "Description": "Çalışma Klasörleri İstemcisi. Kurumsal bir özelliktir. Yazıcı veya dosya paylaşımı gibi ağ özelliklerini kullanmayan ev kullanıcıları için gereksizdir." },
  { "Name": "Microsoft-Windows-ErrorReporting", "Recommended": true, "Description": "Windows Hata Raporlama. Sistem hatalarını Microsoft'a bildirir. **UYARI**: Hata ayıklama veya sistem sorunlarını Microsoft'a bildirme gereksiniminiz yoksa devre dışı bırakılabilir. Gizlilik açısından kapatılması önerilir." },
  { "Name": "Microsoft-Windows-TFTP-Client", "Recommended": true, "Description": "TFTP İstemcisi. Önemsiz Dosya Aktarım Protokolü. Genellikle ağ yöneticileri veya belirli durumlarda kullanılır. Standart kullanıcılar için gereksizdir." },
  { "Name": "Microsoft-Windows-Telnet-Client", "Recommended": true, "Description": "Telnet İstemcisi. Güvenli olmayan uzak bağlantı protokolü. Genellikle kullanılmaz ve güvenlik açığı oluşturabilir, kaldırılması önerilir." },
  { "Name": "Microsoft-Windows-WMP-TIFF-IFilter", "Recommended": true, "Description": "TIFF IFilter. Etiketli Görüntü Dosyası Biçimi için bir filtre. Genellikle TIFF dosyalarıyla özel olarak çalışmıyorsanız gereksizdir." },
  { "Name": "Microsoft-Windows-WinSAT", "Recommended": true, "Description": "Sistem Değerlendirme Aracı (WinSAT). Sistem performansını derecelendirmek için kullanılır. Eski bir özelliktir ve günlük kullanımda faydası düşüktür." },
  { "Name": "Microsoft-Windows-RetailDemoContent", "Recommended": true, "Description": "Perakende Gösteri Modu (RetailDemo). Mağazalardaki teşhir ürünlerinde kullanılan kısıtlı bir moddur. Ev kullanıcıları için kesinlikle gereksizdir." },
  { "Name": "Microsoft-Windows-PrintToPDF", "Recommended": false, "Description": "Microsoft Print to PDF özelliği. PDF oluşturmak için başka bir yazılım (örn. Adobe Acrobat, sanal yazıcılar) kullanıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-Xps-Xps-Viewer", "Recommended": true, "Description": "XPS Belge Görüntüleyici. Microsoft'un PDF'e alternatif olarak geliştirdiği ve yaygınlaşmayan bir dosya formatıdır. XPS dosyalarıyla çalışmıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-Client-NFS", "Recommended": true, "Description": "Ağ Dosya Sistemi (NFS) İstemcisi. Dosyalara ağ üzerinden erişim sağlar. Linux/Unix ağlarıyla çalışmıyorsanız gereksizdir." },
  { "Name": "Microsoft-Windows-SMB1", "Recommended": true, "Description": "SMBv1 Desteği. Eski ağ protokolü. **UYARI**: Eski ağ cihazları (eski NAS cihazları, bazı eski yazıcılar) veya eski Windows sürümleriyle (Windows XP gibi) dosya/yazıcı paylaşımı yapmıyorsanız güvenlik zafiyeti nedeniyle kapatılması **şiddetle tavsiye edilir**." },
  { "Name": "Microsoft-Windows-SMBDirect", "Recommended": true, "Description": "SMB Direct. Uzak dosya sunucusu bağlantısını yerel depolamaya benzetir. Genellikle yüksek performanslı ağ depolama sistemleri için kullanılır. Standart kullanıcılar için gereksizdir." },
  { "Name": "Microsoft-Windows-MessageQueuing", "Recommended": true, "Description": "Microsoft Mesaj Kuyruğu (MSMQ). Ayrı sunucularda çalışan uygulamaların güvenli bağlantı kurmasını sağlar. Yazılım geliştiricileri veya belirli kurumsal uygulamalar için kullanılır. Çoğu kullanıcı için gereksizdir." },
  { "Name": "Microsoft-Windows-SystemRestore", "Recommended": false, "Description": "Sistem Geri Yükleme. **UYARI**: Kaldırılması durumunda sisteminizde bir sorun oluştuğunda önceki bir zamana geri dönme yeteneğini kaybedersiniz. Çok nadiren sorun yaşayan ileri düzey kullanıcılar için düşünülebilir, ancak genellikle önerilmez." },
  { "Name": "Microsoft-Windows-3D-Screensavers", "Recommended": true, "Description": "3D Ekran Koruyucular. Modern Windows sürümlerinde nadiren kullanılır. Sistem kaynağı harcamadan eski ekran koruyucuları arıyorsanız kaldırabilirsiniz." },
  { "Name": "Microsoft-Windows-MobilePC-Sensors", "Recommended": true, "Description": "Mobil PC Sensörleri. Parlaklık ve diğer sensörlerle ilgili hizmetler. Dizüstü bilgisayarınızın parlaklık ayarları gibi otomatik özelliklerini kullanmıyorsanız veya masaüstü PC kullanıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-Camera-Experience", "Recommended": true, "Description": "Kamera Kullanıcı Deneyimi. Windows Kamera uygulamasıyla ilgili ek özellikler. Kamera kullanmıyorsanız veya temel işlevsellik yeterliyse kaldırılabilir." },
  { "Name": "Microsoft-Windows-TextPrediction", "Recommended": true, "Description": "Metin Tahmini. Yazarken kelime önerileri sunar. Klavyeden otomatik tamamlama kullanmıyorsanız kaldırılabilir." },
  { "Name": "Microsoft-Windows-Network-Connectivity-Assistant", "Recommended": true, "Description": "Ağ Bağlantısı Yardımcısı. Ağ sorunlarını gidermeye yardımcı olan bir bileşen. Manuel olarak sorun gidermeyi tercih ediyorsanız veya bu özelliğe ihtiyacınız yoksa kaldırılabilir." },
  { "Name": "Microsoft-Windows-Identity-Foundation", "Recommended": true, "Description": "Windows Identity Foundation. Kimliğe duyarlı uygulama geliştirme altyapısı. Uygulama geliştiricileri dışındaki çoğu kullanıcı için gereksizdir." },
  { "Name": "Microsoft-Windows-WinRE-Recovery", "Recommended": false, "Description": "Windows Kurtarma Ortamı (WinRE). **UYARI**: Bilgisayarınızda ciddi bir sorun olduğunda veya Windows başlamadığında kurtarma seçenekleri sunar. Kaldırılması, sistemi onarma veya sıfırlama yeteneğinizi ciddi şekilde kısıtlar. Deneyimli kullanıcılar ve alternatif bir kurtarma planı olanlar için uygundur." },
  { "Name": "Microsoft-Windows-Error-Reporting-Infrastructure", "Recommended": true, "Description": "Windows Tanılama Altyapısı. Sistemdeki sorunları tespit etmeye yardımcı olur. **UYARI**: Hata raporlama ve telemetriyle bağlantılıdır. Kapatmak gizliliği artırabilir ancak sorun giderme için faydalı olabilecek verileri de engeller." },
  { "Name": "Microsoft-Windows-BranchCache", "Recommended": true, "Description": "BranchCache. Ortak ağlarda dosya önbelleklemesi yapar. Kurumsal ağlarda performans artışı sağlar. Ev kullanıcıları veya küçük ağlar için genellikle gereksizdir." },
  { "Name": "AdobeSystemsIncorporated.AdobePhotoshopExpress", "Recommended": true, "Description": "Adobe Photoshop'un hafif, dokunmatik ekran odaklı versiyonu. Masaüstü versiyonunu kullanıyorsanız gereksizdir." },
  { "Name": "Microsoft.MSPaint", "Recommended": false, "Description": "Klasik Microsoft Paint uygulaması. Hızlı ve basit düzenlemeler için hala kullanışlıdır." },
  { "Name": "Microsoft.MicrosoftStickyNotes", "Recommended": true, "Description": "Yapışkan Notlar uygulaması. Masaüstünde not tutma ihtiyacınız yoksa kaldırılabilir." },
  { "Name": "Microsoft.MicrosoftNews", "Recommended": true, "Description": "Microsoft Haberler uygulaması (Bing Haberler ile aynı veya benzer)." },
  { "Name": "Microsoft.Office.OneNote", "Recommended": true, "Description": "OneNote uygulamasının farklı bir versiyonu. Diğer versiyonu kullanıyorsanız buna gerek olmayabilir." },
  { "Name": "Microsoft.Windows.Photos", "Recommended": false, "Description": "Windows'un varsayılan Fotoğraflar uygulaması. **UYARI**: Kaldırmak, resim dosyalarının varsayılan olarak açılmamasına neden olabilir. Alternatif bir resim görüntüleyiciniz olduğundan emin olun." },
  { "Name": "Microsoft.WindowsCalculator", "Recommended": false, "Description": "Windows Hesap Makinesi uygulaması. Genellikle kullanışlı bir araçtır." },
  { "Name": "Microsoft.WindowsStore", "Recommended": false, "Description": "Microsoft Mağazası. **UYARI**: Kaldırılması, yeni uygulama yüklemenizi ve mevcutları güncellemenizi ENGELLER. Kaldırılması KESİNLİKLE önerilmez." },
  { "Name": "Microsoft.Windows.Cortana", "Recommended": true, "Description": "Cortana dijital asistanı. Gizlilik ve performans için kaldırılması önerilir." },
  { "Name": "Microsoft.MicrosoftEdge.Stable", "Recommended": false, "Description": "Microsoft Edge web tarayıcısı. **UYARI**: Sistemin bazı bölümleri Edge'e bağlı olabilir, kaldırılması beklenmedik sorunlara yol açabilir." }
]